Revit 2027 API
ControlledApplication.LinkedResourceOpened Event
 Subscribe to the LinkedResourceOpened event to be notified immediately after Revit has finished opening a linked resource.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public event EventHandler<LinkedResourceOpenedEventArgs> LinkedResourceOpened
Public Event LinkedResourceOpened As EventHandler(Of LinkedResourceOpenedEventArgs)
public:
 event EventHandler<LinkedResourceOpenedEventArgs^>^ LinkedResourceOpened {
	void add (EventHandler<LinkedResourceOpenedEventArgs^>^ value);
	void remove (EventHandler<LinkedResourceOpenedEventArgs^>^ value);
}
member LinkedResourceOpened : IEvent<EventHandler<LinkedResourceOpenedEventArgs>,
    LinkedResourceOpenedEventArgs>
Value
EventHandler<LinkedResourceOpenedEventArgs>
Remarks
This event is raised immediately after Revit has finished opening a linked resource. Only supports linked resources for following types : Revit; IFC; CAD(dwg, dxf, dgn, sat); Topography; It is raised even when a linked resource opening failed. The LinkedResourceOpened events would not raised if there are no update on linked CAD, IFC resources.
Check the 'Status' field in event's argument to see whether the action itself was successful or not.
Another LinkedResourceOpening event will be raised when Revit is just about to open a linked resource.
See Also
Reference
ControlledApplication Class
Autodesk.Revit.ApplicationServices Namespace